docs: mermadi
